# TP2 - DB Normalization and Querying

The objectives of this TP are:
1. Apply normalization 1NF -> 2NF -> 3NF
2. Perform SQL queries on the normalized database

In this TP, we will use a database **`wine.db`** (available in the course's website) containing wine information related to 'production' and 'sales'. 

> Production <---> Wine <---> Sales


---

### Working with db files in Jupyter
- Python provides an interface for SQLite through the *sqlite3* module
- The **`%%sql`** magic builds upon it (and other tools) to enable the usage of SQL commands within a Jupyter Notebook as in common SQL clients.
- Before proceeding, make sure that **`wine.db`** is in the same path as this notebook.
  - If **`wine.db`** is not in the same path, an empty **`wine.db`** file will be created, resulting in errors in later steps of the TP.
- The SQLite module in Python commits transactions automatically, this means that any change in the DB is immediately written to the file, e.g. creating/deleting tables.
  -  For this reason, it is recommended to have a backup of **`wine.db`** as it is provided in the course's website.

---

**`wine.db`** contains the following unnormalized tables:

<center>**Master1**</center>

|*Attribute*|         *Description*          |
| -------   |--------------------------------|
| NV        | Wine number                    |
| CRU       | Vineyard or group of vineyards |
| DEGRE     | Alcohol content                |
| MILL      | Vintage year                   |
| QTE       | Number of bottles harvested    |
| NP        | Producer number                |
| NOM       | Producer's last name           |
| PRENOM    | Producer's first name          |
| REGION    | Production region              |

From wikipedia:

__Cru__: Often used to indicate a specifically named and legally defined vineyard or ensemble of vineyards and the vines "which grow on [such] a reputed terroir; by extension of good quality." The term is also used to refer to the wine produced from such vines.


<center>**Master2**</center>

|*Attribute*|                         *Description*                  |
| -------   |--------------------------------------------------------|
| NV        | Wine number                                            |
| CRU       | Vineyard or group of vineyards                         |
| DEGRE     | Alcohol content                                        |
| MILL      | Vintage year                                           |
| DATES     | Buying date                                            |
| LIEU      | Place where the wine was sold                          |
| QTE       | Number of bottles bought                               |
| NB        | Client (buveur) number                                 |
| NOM       | Client's last name                                     |
| PRENOM    | Client's first name                                    |
| TYPE      | Type of client by volume of purchases                  |
| REGION    | Administrative Region (different to production region) |

In [8]:
import sqlite3    # Python interface for SQLite databases

In [9]:
def printSchema(connection):
    # Function to print the DB schema
    # Source: http://stackoverflow.com/a/35092773/4765776
    for (tableName,) in connection.execute(
        """
        select NAME from SQLITE_MASTER where TYPE='table' order by NAME;
        """
    ):
        print("{}:".format(tableName))
        for (
            columnID, columnName, columnType,
            columnNotNull, columnDefault, columnPK,
        ) in connection.execute("pragma table_info('{}');".format(tableName)):
            print("  {id}: {name}({type}){null}{default}{pk}".format(
                id=columnID,
                name=columnName,
                type=columnType,
                null=" not null" if columnNotNull else "",
                default=" [{}]".format(columnDefault) if columnDefault else "",
                pk=" *{}".format(columnPK) if columnPK else "",
            ))

In [10]:
conn = sqlite3.connect('wine.db')
c = conn.cursor()
print("Database schema:")
printSchema(conn)           # An usefull way to viualize the content of the database

Database schema:
Customer:
  0: NB(NUM)
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: TYPE(TEXT)
  4: REGION(TEXT)
MASTER1:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
  4: QTE(NUM)
  5: NP(NUM)
  6: NOM(TEXT)
  7: PRENOM(TEXT)
  8: REGION(TEXT)
MASTER2:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
  4: DATES(DATE)
  5: LIEU(TEXT)
  6: QTE(NUM)
  7: NB(NUM)
  8: NOM(TEXT)
  9: PRENOM(TEXT)
  10: TYPE(TEXT)
  11: REGION(TEXT)
ProducedBottles:
  0: NV(NUM)
  1: NP(NUM)
  2: QTE(NUM)
Production:
  0: NP(NUM)
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: REGION(TEXT)
RBA:
  0: NB(NUM)
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: TYPE(TEXT)
RBB:
  0: NB(NUM)
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: TYPE(TEXT)
Sale:
  0: NB(NUM)
  1: NV(NUM)
  2: DATES(NUM)
  3: LIEU(TEXT)
  4: QTE(NUM)
Wine:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)

From this point we will use __%%sql__ magic

In [11]:
%load_ext sql
%sql sqlite:///wine.db

'Connected: @wine.db'

# PART I: Database normalization

The first task on this TP is the normalization of the wine data. In its current state both tables **Master1** and **Master2** are in the First Normal Form (1NF).

By inspecting the content of these tables we can see that multiple tuples have NULL values.

In [12]:
%%sql SELECT *
FROM Master1
LIMIT 10;

 * sqlite:///wine.db
Done.

[(None, None, None, None, None, 3, 'Six', 'Paul', 'Alsace'),
 (None, None, None, None, None, 6, 'Marmagne', 'Bernard', 'Bourgogne'),
 (None, None, None, None, None, 8, "Lioger d'Harduy", 'Gabriel', 'Bourgogne'),
 (None, None, None, None, None, 16, 'Barbin', 'Bernard', 'Bourgogne'),
 (None, None, None, None, None, 17, 'Faiveley', 'Guy', 'Bourgogne'),
 (None, None, None, None, None, 18, 'Tramier', 'Jean', 'Bourgogne'),
 (None, None, None, None, None, 19, 'Dupaquier', 'Roger', 'Bourgogne'),
 (None, None, None, None, None, 20, 'Lamy', 'Jean', 'Bourgogne'),
 (None, None, None, None, None, 21, 'Cornu', 'Edmond', 'Bourgogne'),
 (None, None, None, None, None, 26, 'Violot', 'Gilbert', 'Bourgogne')]

* Notice that Jupyter *displays* 'None' instead of 'NULL'. 
  - This is only to comply with python notation.
* To account for NULL values, your SQL queries must test explicitly for 'NULL'.

Another problem in **Master1** and **Master2** is data redundancy, for example:

In [13]:
%%sql SELECT *
FROM Master1
WHERE NV = 45;

 * sqlite:///wine.db
Done.

[(45, 'Chiroubles', None, 1983, 90, 2, 'Boxler', 'Albert', 'Alsace'),
 (45, 'Chiroubles', None, 1983, 912, 67, 'Descombes', 'Jean Ernest', 'Beaujolais'),
 (45, 'Chiroubles', None, 1983, 98, 71, 'Chalandard', 'Danile', 'Jura'),
 (45, 'Chiroubles', None, 1983, 540, 78, 'Michlel', 'Pierre Emile', 'Jura'),
 (45, 'Chiroubles', None, 1983, 450, 86, 'Dumazet', 'Marc', 'Rhone')]

---

Additional resource for Normalization:

https://www.youtube.com/watch?v=UrYLYV7WSHM

---

#### Exercise 1.1

Convert table **Master1** to the Second Normal Form (2NF) or Third Normal Form (3NF) as applicable.
* Explain your answer
* List main functional dependencies (not all of them)
* Describe the schema of new tables and how they relate
  * You can write Tables as above or you can insert images in the notebook.
  
Remember that **`wine.db`** contains information related to wine 'production' and 'sells'.

> Production <---> Wine <---> Sales

A good start point is to look for the 'Wine' attributes.

**Hint:** Look for redundant information between the master tables.

---

<center>**MY ANSWER FOR EXERCISE 1.1**</center>

EXPLANATION: 

The main MASTER1 table is not normalized, main issues are: data redundancies, table misstructures and everything is put in one single table to represent the PRODUCTIONS.
As a first heuristic, we can see that the rlation between the wines produced and the producers is a Many-to-Many relation, since multiple producers can produce the same wine, and a wine can be produced by more than one producer with different number of bottles (QTE). So, we should split this big table into three tables, which are: Wine, Productions and ProducedBottles. The latter one is a join table that links the Wine and Productions. This way we removed redundancies and describe the wine in a single table, and have info about the producer in the Production table.

Main Functional Dependencies:

NV -> CRU, DEGRE, MILL<br>
NP -> NOM, PRENOM, REGION<br>
NV, NP -> QTE

<center>**Wine**</center>

|*Attribute*|         *Description*          |
| -------   |--------------------------------|
| NV        | Wine number   (PK)             |
| CRU       | Vineyard or group of vineyards |
| DEGRE     | Alcohol content                |
| MILL      | Vintage year                   |


<center>**Production**</center>

|*Attribute*|         *Description*          |
| -------   |--------------------------------|
| NP        | Producer number (PK)           |
| NOM       | Producer's last name           |
| PRENOM    | Producer's first name          |
| REGION    | Production region              |

<center>**ProducedBottles**</center>

|*Attribute*|         *Description*          |
| -------   |--------------------------------|
| NV        | Wine number   (FK)             |
| NP        | Producer number (FK)           |
| QTE       | Number of bottles harvested    |

We should note that the PK in the ProducedBottles table is the couple (NV, NP) where each one of them is a key for another table.

We should also state that all tables are now in 3rd Normal Form (3NF), since each entry is atomic, any non-key attribute is not dependant on a key part and there are no FD between non-key attributes.

___

#### Exercise 1.2

Convert table **Master2** to the Second Normal Form (2NF) or Third Normal Form (3NF) as applicable.
* Explain your answer
* List main functional dependencies (not all of them)
* Describe the schema of new tables and how they relate
  * You can write Tables as above or you can insert images in the notebook.

**Note:** For this part, consider that a wine can be bought in multiple locations and multiple times per day.

___

<center>**MY ANSWER FOR EXERCISE 1.2**</center>

EXPLANATION: 

The main MASTER2 table is also not normalized and have data redundancies which most of them are now solved by EX1.1, and this table represents the SALES.

<strike>Starting from where we left off EX1.1, we already have data describing the Wine and the Producers, now we need to represent the Sale and the Customer, so we need two additional tables: Customer which contains atomic info about each buyer, and Sale which represent a receipt that is a result of a Customer buying a Wine from a Producer, so this table has a PK which is the triplet : (NB, NP, NV). 
This way we omit redundancy and still preserve the 3NF, because we don't have contradicting dependencies.
</strike>
I realised that I developed the exercise further than what was needed, I related the Producer with the Master2, which was not required nor suggested! That's why I striked through the wrong parts all along my answers!


We will use the same Wine table from EX1.1 with the same definition, and we will add another table which is Customer. It represents the buyer and all the details related to him, and another table: Sale to describe the purchases made by each buyer atomically and without redundancy. It's primary key is the couple : (NB, NV)

Main Functional Dependencies:

NB -> NOM, PRENOM, TYPE<br>
NB, NV -> DATES, LIEU, REGION, QTE
<strike>NB, NV, NP -> DATES, LIEU, QTE</strike><br>

In addition to the Wine table <strike>and Production table</strike>, we need:

<center>**Customer**</center>

|*Attribute*|         *Description*          |
| -------   |--------------------------------|
| NB        | Client (buveur) number   (PK)  |
| NOM       | Client's last name             |
| PRENOM    | Client's first name            |
| TYPE      | Type of client by volume of purchases|



<center>**Sale**</center>

|*Attribute*|         *Description*          |
| -------   |--------------------------------|
| NB        | Client (buveur) number   (FK)  |
| NV        | Wine number              (FK)  |
| DATES     | Buying date                    |
| LIEU      | Place where the wine was sold  |
| REGION    | Administrative Region (different to production region) |
| QTE       | Number of bottles bought       |

---

Once you have defined the 2NF or 3NF (as applicable) we need to split the data into new tables.

A table can be created from the result of a query.

In the following example we will create a new table "dummy" to store the different values of alcohol content.

In [14]:
%%sql DROP TABLE IF EXISTS dummy;

-- Create dummy table
CREATE TABLE dummy AS
SELECT DISTINCT DEGRE
FROM MASTER1;

 * sqlite:///wine.db
Done.
Done.

[]

In [15]:
print("\nContent of the database")
printSchema(conn)

Content of the database
Customer:
  0: NB(NUM)
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: TYPE(TEXT)
  4: REGION(TEXT)
MASTER1:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
  4: QTE(NUM)
  5: NP(NUM)
  6: NOM(TEXT)
  7: PRENOM(TEXT)
  8: REGION(TEXT)
MASTER2:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
  4: DATES(DATE)
  5: LIEU(TEXT)
  6: QTE(NUM)
  7: NB(NUM)
  8: NOM(TEXT)
  9: PRENOM(TEXT)
  10: TYPE(TEXT)
  11: REGION(TEXT)
ProducedBottles:
  0: NV(NUM)
  1: NP(NUM)
  2: QTE(NUM)
Production:
  0: NP(NUM)
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: REGION(TEXT)
RBA:
  0: NB(NUM)
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: TYPE(TEXT)
RBB:
  0: NB(NUM)
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: TYPE(TEXT)
Sale:
  0: NB(NUM)
  1: NV(NUM)
  2: DATES(NUM)
  3: LIEU(TEXT)
  4: QTE(NUM)
Wine:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
dummy:
  0: DEGRE(NUM)

In [16]:
%%sql
SELECT *
FROM dummy;

 * sqlite:///wine.db
Done.

[(None,),
 (11.5,),
 (11.3,),
 (12.1,),
 (10.9,),
 (11.7,),
 (11.2,),
 (12.3,),
 (11.9,),
 (11.8,),
 (10.7,),
 (11.4,),
 (10.5,),
 (11,),
 (11.6,),
 (12,),
 (10,),
 (12.5,),
 (10.8,),
 (14,),
 (11.1,),
 (13,)]

Looking into "dummy", we notice that our query includes NULL. This is not allowed if we were to use DEGRE as key for a table.

To correct this, we need to change the query to explicitly test for NULL as follows:

In [17]:
%%sql DROP TABLE IF EXISTS dummy;

-- Create dummy table
CREATE TABLE dummy AS
SELECT DISTINCT DEGRE
FROM MASTER1
WHERE DEGRE IS NOT NULL;

SELECT *
FROM dummy;

 * sqlite:///wine.db
Done.
Done.
Done.

[(11.5,),
 (11.3,),
 (12.1,),
 (10.9,),
 (11.7,),
 (11.2,),
 (12.3,),
 (11.9,),
 (11.8,),
 (10.7,),
 (11.4,),
 (10.5,),
 (11,),
 (11.6,),
 (12,),
 (10,),
 (12.5,),
 (10.8,),
 (14,),
 (11.1,),
 (13,)]

Notice that we use `NULL` given that `None` is only used for display.

In [18]:
# Remove "dummy" table
%sql DROP TABLE IF EXISTS dummy;

 * sqlite:///wine.db
Done.

[]

#### Exercise 1.3

Create the new tables from Master1:

In [21]:
%%sql

-- Create Wine table
CREATE TABLE Wine AS
SELECT DISTINCT NV, CRU, DEGRE, MILL
FROM MASTER1
WHERE NV IS NOT NULL;

-- Create Production table
CREATE TABLE Production AS
SELECT DISTINCT NP, NOM, PRENOM, REGION
FROM MASTER1
WHERE NP IS NOT NULL;

-- Create ProducedBottles table
CREATE TABLE ProducedBottles AS
SELECT DISTINCT NV, NP, QTE
FROM MASTER1
WHERE NP IS NOT NULL and NV IS NOT NULL;

 * sqlite:///wine.db
Done.
Done.
Done.

[]

In [20]:
%%sql
DROP TABLE IF EXISTS Wine;
DROP TABLE IF EXISTS Production;
DROP TABLE IF EXISTS ProducedBottles;

 * sqlite:///wine.db
Done.
Done.
Done.

[]

#### Exercise 1.4

Create the new tables from Master2:

In [27]:
%%sql

-- Create Customer table
CREATE TABLE Customer AS
SELECT DISTINCT NB, NOM, PRENOM, TYPE
FROM MASTER2
WHERE NB IS NOT NULL;

-- Create Sale table
CREATE TABLE Sale AS
SELECT DISTINCT NB, NV, DATES, LIEU, REGION, QTE
FROM MASTER2
WHERE NB IS NOT NULL and NV IS NOT NULL;

 * sqlite:///wine.db
Done.
Done.

[]

In [26]:
%%sql
DROP TABLE IF EXISTS Customer;
DROP TABLE IF EXISTS Sale;

 * sqlite:///wine.db
Done.
Done.

[]

# PART II: SQL QUERIES

In the second part of this TP you will create SQL queries to retrieve information from the database.

**Important:**

- You MUST use the normalized tables created in previous steps.
  - The normalized tables will also be used in TP3.
- Do NOT use **Master1** and **Master2** in your queries.

#### Exercise 2.1

What are the different types of clients (buveurs) by volume of purchases?

In [ ]:
%%sql
SELECT 
DISTINCT TYPE AS 'Drinkers Type'
FROM Customer;

#### Exercise 2.2

What regions produce Pommard or Brouilly?

In [ ]:
%sql SELECT * FROM Wine

In [ ]:
%%sql
SELECT
   CRU, REGION  
FROM Production 
    INNER JOIN ProducedBottles on Production.NP = ProducedBottles.NP
        INNER JOIN Wine on ProducedBottles.NV = Wine.NV
WHERE CRU IN ('Pommard', 'Brouilly');

#### Exercise 2.3

What regions produce Pommard and Brouilly?

In [1]:
%%sql
SELECT
   CRU, REGION  
FROM 
    ( SELECT CRU, REGION FROM Production 
    INNER JOIN ProducedBottles on Production.NP = ProducedBottles.NP
        INNER JOIN Wine on ProducedBottles.NV = Wine.NV
WHERE CRU IN ('Pommard', 'Brouilly');

UsageError: Cell magic `%%sql` not found.

In [ ]:
%%sql
SELECT
    REGION  
FROM Production 
    INNER JOIN ProducedBottles on Production.NP = ProducedBottles.NP
        INNER JOIN Wine on ProducedBottles.NV = Wine.NV
WHERE CRU IN ('Pommard', 'Brouilly')
GROUP BY REGION
HAVING COUNT() = 2;

#### Exercise 2.4

Get the number of wines bought by CRU and Millésime

In [ ]:
%%sql
SELECT 
    CRU, MILL, SUM(QTE) AS 'Number of Bought Wine'
FROM Wine INNER JOIN
        Sale on Wine.NV = Sale.NV
GROUP BY CRU, MILL

#### Exercise 2.5

Retrieve the wine number (NV) of wines produced by more than three producers

In [ ]:
%%sql
SELECT
    Wine.NV, COUNT(Production.NP) AS 'Number of Producers'
FROM Wine 
    INNER JOIN ProducedBottles on Wine.NV = ProducedBottles.NV
        INNER JOIN Production on ProducedBottles.NP = Production.NP
GROUP BY Wine.NV
HAVING COUNT(Production.NP) > 3;

#### Exercise 2.6

Which producers have not produced any wine?

In [ ]:
%%sql
SELECT 
     DISTINCT Production.NP, Production.NOM, Production.PRENOM
FROM Production 
        LEFT JOIN ProducedBottles on Production.NP = ProducedBottles.NP
WHERE 
    Production.NP NOT IN (SELECT NP FROM ProducedBottles)
ORDER BY Production.NP

#### Exercise 2.7

What clients (buveurs) have bought at least one wine from 1980?

In [ ]:
%%sql
SELECT DISTINCT
    Customer.NB, NOM, PRENOM, MILL
FROM
    Customer INNER JOIN Sale 
                        on Customer.NB = Sale.NB
             INNER JOIN Wine
                        on Wine.NV = Sale.NV
                               AND
                           MILL = '1980'
ORDER BY Customer.NB

#### Exercise 2.8

What clients (buveurs) have NOT bought any wine from 1980?

In [ ]:
%%sql
SELECT DISTINCT
    NB, NOM, PRENOM
FROM 
    Customer
WHERE NB NOT IN
(
SELECT DISTINCT
    Customer.NB
FROM
    Customer INNER JOIN Sale 
                        on Customer.NB = Sale.NB
             INNER JOIN Wine
                        on Wine.NV = Sale.NV
                               AND
                           MILL = '1980'
)
ORDER BY NB

#### Exercise 2.9

What clients (buveurs) have bought ONLY wines from 1980?

In [ ]:
%%sql
SELECT DISTINCT
    NB, NOM, PRENOM
FROM CUSTOMER
WHERE 
NB IN
(   SELECT
        Customer.NB
    FROM
    Customer INNER JOIN Sale 
                        on Customer.NB = Sale.NB
             INNER JOIN Wine
                        on Wine.NV = Sale.NV
                               AND
                           MILL = '1980'
)
AND
NB NOT IN
(   SELECT
        Customer.NB
    FROM
    Customer INNER JOIN Sale 
                        on Customer.NB = Sale.NB
             INNER JOIN Wine
                        on Wine.NV = Sale.NV
                               AND
                           MILL <> '1980'
)
ORDER BY Customer.NB

#### Exercise 2.10

List all wines from 1980

In [ ]:
%%sql
SELECT
    NV, CRU, MILL, DEGRE
FROM
    Wine
WHERE
    MILL = '1980'

#### Exercise 2.11

What are the wines from 1980 bought by NB=2?

In [ ]:
%%sql
SELECT DISTINCT
    Wine.NV, CRU, MILL, DEGRE
FROM
    Wine
        INNER JOIN Sale
            on Sale.NV = Wine.NV
                INNER JOIN Customer on Customer.NB = Sale.NB
WHERE
    MILL = '1980' and Sale.NB = 2

#### Exercise 2.12

What clients (buveurs) have bought ALL the wines from 1980?

In [ ]:
%%sql
SELECT DISTINCT
    Customer.NB, NOM, PRENOM
FROM
    Customer
        INNER JOIN Sale
                on Sale.NB = Customer.NB
            INNER JOIN Wine
                on Sale.NV = Wine.NV
                    AND
                   MILL = '1980'
GROUP BY
    Customer.NB
HAVING
    COUNT(QTE)
        =
    (SELECT COUNT() FROM Wine WHERE MILL = '1980')